# Winston James Anonat Bocol

### U24200087G | Exercise 1

---

### Example Code M1

In [2]:
#Basic Libaries - importing stuff we need
import numpy as np
import pandas as pd #dataframe library

In [ ]:
#DataFrame Example
personel_Dict = {'Name': ['John', 'Anna', 'Peter', 'Linda'],
        'Age': [28, 24, 35, 32],
        'City': ['New York', 'Paris', 'Berlin', 'London']}

personel_df = pd.DataFrame(personel_Dict) #making DataFrame from dictionary
personel_df #Dataframes are simlilar to dictionaries

    Name  Age      City
0   John   28  New York
1   Anna   24     Paris
2  Peter   35    Berlin
3  Linda   32    London

In [8]:
#To only access the columns names
personel_df['Name']  #Accessing only the 'Name' column

0     John
1     Anna
2    Peter
3    Linda
Name: Name, dtype: object

In [ ]:
#Now just accessing a row from the DataFrame
personel_df.iloc[2]  #Accessing the 3rd row (index 2)

Name     Peter
Age         35
City    Berlin
Name: 2, dtype: object

### Importing Data from other sources

In [ ]:
#Importing from CSV files
csv_data = pd.read_csv('../datasets/data(1)/somedata.csv',header= None) #Header will assume first line to be the head if =0, otherwise on =None, it's just numbers
csv_data.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18
0,1,12.6,12.3,1.0708,23,154.25,67.75,23.7,134.9,36.2,93.1,85.2,94.5,59.0,37.3,21.9,32.0,27.4,17.1
1,2,6.9,6.1,1.0853,22,173.25,72.25,23.4,161.3,38.5,93.6,83.0,98.7,58.7,37.3,23.4,30.5,28.9,18.2
2,3,24.6,25.3,1.0414,22,154.00,66.25,24.7,116.0,34.0,95.8,87.9,99.2,59.6,38.9,24.0,28.8,25.2,16.6
3,4,10.9,10.4,1.0751,26,184.75,72.25,24.9,164.7,37.4,101.8,86.4,101.2,60.1,37.3,22.8,32.4,29.4,18.2
4,5,27.8,28.7,1.0340,24,184.25,71.25,25.6,133.1,34.4,97.3,100.0,101.9,63.2,42.2,24.0,32.2,27.7,17.7

In [27]:
print("Data Types: ", type(csv_data)) #This shows that the data type is a DataFrame
print("Data Dimensions: ", csv_data.shape) #This shows the dimensions(size) of the DataFrame (rows, columns)

Data Types:  <class 'pandas.core.frame.DataFrame'>
Data Dimensions:  (252, 19)

In [ ]:
#Importing from TXT files
txt_data = pd.read_table('../datasets/data(1)/somedata.txt', sep = "\s+", header = None)
print("Data from TXT file:")
txt_data.head()


#Importing from XLS files
xls_data = pd.read_excel('../datasets/data(1)/somedata.xlsx', header = None)
print("Data from XLS file:")
xls_data.head()

#Importing from JSON files
json_data = pd.read_json('../datasets/data(1)/somedata.json')
print("Data from JSON file:")
json_data.head()

Data from TXT file:
Data from XLS file:
Data from JSON file:

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18
0,1,12.6,12.3,1.0708,23,154.25,67.75,23.7,134.9,36.2,93.1,85.2,94.5,59.0,37.3,21.9,32.0,27.4,17.1
1,2,6.9,6.1,1.0853,22,173.25,72.25,23.4,161.3,38.5,93.6,83.0,98.7,58.7,37.3,23.4,30.5,28.9,18.2
2,3,24.6,25.3,1.0414,22,154.00,66.25,24.7,116.0,34.0,95.8,87.9,99.2,59.6,38.9,24.0,28.8,25.2,16.6
3,4,10.9,10.4,1.0751,26,184.75,72.25,24.9,164.7,37.4,101.8,86.4,101.2,60.1,37.3,22.8,32.4,29.4,18.2
4,5,27.8,28.7,1.0340,24,184.25,71.25,25.6,133.1,34.4,97.3,100.0,101.9,63.2,42.2,24.0,32.2,27.7,17.7

In [ ]:

#Importing from HTML files
html_data = pd.read_html('https://www.boxofficemojo.com/?ref_=bo_nb_shs_mojologo') #You can import data from any URL into tables
print("Data from HTML file:")
html_data[0].head()  #pd.read_html returns a list of DataFrames, different indexes correspond to different tables found in the HTML

Data from HTML file:

                                                   0           1
0                                         Tron: Ares  $1,857,994
1                                            Roofman    $738,887
2                           One Battle After Another    $672,189
3                                       Soul on Fire    $279,634
4  Demon Slayer: Kimetsu no Yaiba- The Movie - In...    $260,499

---

## Problem 1

In [37]:
#1a) Imported "train.csv" data into train_data
train_data = pd.read_csv('../datasets/train(1).csv',header=None)
train_data.head()

,0,1,2,3,4,5,6,7,8,9,...,71,72,73,74,75,76,77,78,79,80
0,Id,MSSubClass,MSZoning,LotFrontage,LotArea,Street,Alley,LotShape,LandContour,Utilities,...,PoolArea,PoolQC,Fence,MiscFeature,MiscVal,MoSold,YrSold,SaleType,SaleCondition,SalePrice
1,1,60,RL,65,8450,Pave,NaN,Reg,Lvl,AllPub,...,0,NaN,NaN,NaN,0,2,2008,WD,Normal,208500
2,2,20,RL,80,9600,Pave,NaN,Reg,Lvl,AllPub,...,0,NaN,NaN,NaN,0,5,2007,WD,Normal,181500
3,3,60,RL,68,11250,Pave,NaN,IR1,Lvl,AllPub,...,0,NaN,NaN,NaN,0,9,2008,WD,Normal,223500
4,4,70,RL,60,9550,Pave,NaN,IR1,Lvl,AllPub,...,0,NaN,NaN,NaN,0,2,2006,WD,Abnorml,140000

In [42]:
#1b) Display the dimensions of train_data
print("Train Data Dimensions,(rows, columns): ", train_data.shape)

Train Data Dimensions,(rows, columns):  (1461, 81)

In [43]:
#1c) Data types(dtypes) - Numeric/Catagorical - of columns
print(train_data.dtypes) #shows variables and their types

0     object
1     object
2     object
3     object
4     object
       ...
76    object
77    object
78    object
79    object
80    object
Length: 81, dtype: object

In [ ]:
#1c